In [5]:
import pandas as pd

In [6]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)

In [7]:
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [8]:
df['Salario'] = [30000, 50000, 65000, 75000]

In [9]:
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    50000
2  Carlos    22   Valencia    65000
3    Sara    27     Bilbao    75000

In [10]:
df['Salario'] = df['Salario'] + 2000

In [11]:
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    32000
1    Luis    30  Barcelona    52000
2  Carlos    22   Valencia    67000
3    Sara    27     Bilbao    77000

In [13]:
nombres = df['Nombre']

In [14]:
nombres

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

In [18]:
nombres.str.upper()

0       ANA
1      LUIS
2    CARLOS
3      SARA
Name: Nombre, dtype: object

In [22]:
edades_may25 = df[df['Edad'] > 25]

In [23]:
edades_may25

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    52000
3   Sara    27     Bilbao    77000